data-preprocessing-with-numpy/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-24 Tue 16:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introdução ao NumPy Para Processamento de Tensores</title>
<meta name="author" content="Diogo G. Bonofre dos Santos" />
<meta name="description" content="Apresentação dos métodos essenciais para utilização e leitura de códigos NumPy e exercícios para fixação do conteúdo." />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Introdução ao NumPy Para Processamento de Tensores</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org995aafb">1. Processamento de Arrays N-Dimensionais com NumPy</a>
<ul>
<li><a href="#org2ae2c76">1.1. Operações de Forma</a></li>
<li><a href="#org3e55524">1.2. Operações aritméticas</a></li>
<li><a href="#org64782f3">1.3. Agregações matemáticas</a></li>
<li><a href="#org133a4df">1.4. Indexação e fatiamento (<i>slicing</i>)</a>
<ul>
<li><a href="#orgbcde20f">1.4.1. Indexação booleana</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgad6871e">2. Algumas particularidades do NumPy que você deve conhecer</a></li>
<li><a href="#org641b916">3. Exercícios Propostos</a></li>
<li><a href="#org4ab417f">4. Referências</a></li>
</ul>
</div>
</div>
<div id="outline-container-org995aafb" class="outline-2">
<h2 id="org995aafb"><span class="section-number-2">1.</span> Processamento de Arrays N-Dimensionais com NumPy</h2>
<div class="outline-text-2" id="text-1">
<p>
Para importar o NumPy é simples:
</p>
<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #282a2e;">import</span> numpy <span style="color: #282a2e;">as</span> np
</code></pre>
</div>

<p>
O objeto central no NumPy é o <code>ndarray</code> (que significa &ldquo;n-dimensional array&rdquo;). Podemos criá-los:
</p>
<ul class="org-ul">
<li>A partir de listas Python: <code>np.array()</code> cria um array/tensor 1D</li>
<li>Com funções de preenchimento: <code>np.zeros((3, 4))</code> cria uma matriz 3x4 preenchida com zeros</li>
<li>Com sequências numéricas: <code>np.arange(0, 10, 2)</code> cria um array contendo uma sequência de valores uniformemente espaçados (ex: 0, 2, 4, 6, 8). O <code>np.linspace(0, 10, 5)</code> cria um número exato de valores linearmente espaçados em um determinado intervalo.</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #969896;">arr</span> <span style="color: #282a2e;">=</span> np.zeros((3, 4))

<span style="color: #969896;">print</span>(arr)
<span style="color: #969896;">print</span>(np.arange(0, 10, 2))
<span style="color: #969896;">print</span>(np.linspace(0, 10, 5))
</code></pre>
</div>
</div>
<div id="outline-container-org2ae2c76" class="outline-3">
<h3 id="org2ae2c76"><span class="section-number-3">1.1.</span> Operações de Forma</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #969896;">print</span>(arr.shape)
</code></pre>
</div>
<p>
Retorna o formato do array no formato (linhas, colunas).
</p>

<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #969896;">print</span>(arr.ndim)
</code></pre>
</div>
<p>
Retorna o número de eixos (dimensões).
</p>

<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #969896;">print</span>(arr.size)
</code></pre>
</div>
<p>
Retorna a quantidade total de valores.
</p>

<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #969896;">print</span>(arr.reshape((6, <span style="color: #282a2e;">-</span>1)))
</code></pre>
</div>
<p>
Retorna o array com suas dimensões reorganizadas.
</p>

<p>
Note que ele deve ser capaz de comportar o mesmo número de valores do array original. Além disso, se você souber de quantas linhas precisa, mas não quantas colunas (ou vice-versa), você pode passar -1 como argumento para a função.
</p>
</div>
</div>
<div id="outline-container-org3e55524" class="outline-3">
<h3 id="org3e55524"><span class="section-number-3">1.2.</span> Operações aritméticas</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Os operadores aritméticos básicos +, -, *, / realizam operações elemento a elemento (element-wise) automaticamente ao lidar com arrays, gerando novos arrays como resultado.
</p>
<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #969896;">arrx</span> <span style="color: #282a2e;">=</span> np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
<span style="color: #969896;">arry</span> <span style="color: #282a2e;">=</span> np.array([[121, 232, 381], [403, 543, 681], [702, 884, 934]])

<span style="color: #969896;">print</span>(arrx <span style="color: #282a2e;">+</span> arry)
<span style="color: #969896;">print</span>(arrx <span style="color: #282a2e;">-</span> arry)
<span style="color: #969896;">print</span>(arrx <span style="color: #282a2e;">*</span> arry)
<span style="color: #969896;">print</span>(arrx <span style="color: #282a2e;">/</span> arry)
<span style="color: #969896;">print</span>(np.dot(arrx, arry)) <span style="color: #c5c8c6; font-style: italic;"># </span><span style="color: #c5c8c6; font-style: italic;">Produto escalar/dot product</span>
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org64782f3" class="outline-3">
<h3 id="org64782f3"><span class="section-number-3">1.3.</span> Agregações matemáticas</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #969896;">print</span>(arrx.<span style="color: #969896;">sum</span>())
<span style="color: #969896;">print</span>(arrx.<span style="color: #969896;">min</span>())
<span style="color: #969896;">print</span>(arrx.<span style="color: #969896;">max</span>())
<span style="color: #969896;">print</span>(arrx.mean())
</code></pre>
</div>
<ul class="org-ul">
<li>Se o parâmetro <code>axis=0</code>, a operação é realizada nas colunas</li>
<li>Se <code>axis=1</code>, a operação é realizada nas linhas</li>
</ul>
</div>
</div>
<div id="outline-container-org133a4df" class="outline-3">
<h3 id="org133a4df"><span class="section-number-3">1.4.</span> Indexação e fatiamento (<i>slicing</i>)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Podemos usar dois pontos para separar a notação padrão de fatiamento do Python em dimensões ao lidar com arrays NumPy.
</p>
<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #969896;">print</span>(arrx[1:,1:])
</code></pre>
</div>
</div>
<div id="outline-container-orgbcde20f" class="outline-4">
<h4 id="orgbcde20f"><span class="section-number-4">1.4.1.</span> Indexação booleana</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Podemos aplicar máscaras condicionais.
</p>

<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #969896;">print</span>(arrx[arrx <span style="color: #282a2e;">&gt;</span> 5])
</code></pre>
</div>
<p>
Retorna todos os valores acima de 5 extraídos do array original em um array plano (1D).
</p>

<div class="org-src-container">
<pre class="src src-python"><code><span style="color: #969896;">print</span>(np.where(arrx <span style="color: #282a2e;">&gt;</span> 5))
</code></pre>
</div>
<p>
Retorna todos os índices que satisfazem a condição.
</p>

<p>
Também podemos usar a função na forma <code>np.where(arrx &gt; 5, 1, 0)</code> para substituir os valores do array com base no fato de satisfazerem ou não a condição.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgad6871e" class="outline-2">
<h2 id="orgad6871e"><span class="section-number-2">2.</span> Algumas particularidades do NumPy que você deve conhecer</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Ao atribuir fatias de um array a outra variável, ele não copia os dados, apenas cria uma visualização (view) na memória;</li>
<li>Sempre use <code>b = a.copy()</code> quando precisar de dados independentes;</li>
<li>Sempre valide as dimensões (shapes) das suas matrizes.</li>
</ul>
</div>
</div>
<div id="outline-container-org641b916" class="outline-2">
<h2 id="org641b916"><span class="section-number-2">3.</span> Exercícios Propostos</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Crie um array unidimensional (1D) contendo os números de 1 a 12 usando uma função Numpy.</li>
<li>Transforme este array em uma matriz 2D com 3 linhas e 4 colunas.</li>
<li>Imprima a matriz, seu formato (shape) e a quantidade total de elementos (size).</li>
<li>Crie uma &ldquo;máscara booleana&rdquo; da matriz do primeiro exercício que identifique quais números são pares.</li>
<li>Use indexação booleana para criar um novo array contendo apenas os números pares extraídos da matriz.</li>
<li>Use a função <code>np.where</code> para criar uma nova matriz onde todos os números maiores que 6 sejam substituídos por 0.</li>
<li>Crie uma matriz 2x2 preenchida apenas com uns usando <code>np.ones</code>.</li>
<li>Crie uma segunda matriz 2x2 apenas com números pseudoaleatórios ou definidos manualmente.</li>
<li>Calcule a multiplicação elemento a elemento (element-wise) dessas duas matrizes.</li>
<li>Calcule o produto escalar (dot product) usando a função ou operador apropriado e compare os resultados.</li>
<li>Crie um tensor 3x3 com valores sequenciais de 1 a 9.</li>
<li>Calcule a soma de todos os elementos na matriz.</li>
<li>Encontre o maior valor de cada coluna.</li>
<li>Calcule a média de cada linha.</li>
</ol>
</div>
</div>
<div id="outline-container-org4ab417f" class="outline-2">
<h2 id="org4ab417f"><span class="section-number-2">4.</span> Referências</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://numpy.org/doc/stable/user/whatisnumpy.html">https://numpy.org/doc/stable/user/whatisnumpy.html</a></li>
<li><a href="https://numpy.org/doc/stable/user/basics.creation.html">https://numpy.org/doc/stable/user/basics.creation.html</a></li>
<li><a href="https://numpy.org/doc/stable/user/basics.indexing.html">https://numpy.org/doc/stable/user/basics.indexing.html</a></li>
<li><a href="https://numpy.org/doc/stable/user/basics.broadcasting.html">https://numpy.org/doc/stable/user/basics.broadcasting.html</a></li>
<li><a href="https://numpy.org/doc/stable/user/basics.copies.html">https://numpy.org/doc/stable/user/basics.copies.html</a></li>
<li><a href="https://numpy.org/doc/stable/user/absolute_beginners.html">https://numpy.org/doc/stable/user/absolute_beginners.html</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Diogo G. Bonofre dos Santos</p>
<p class="date">Created: 2026-03-24 Tue 16:12</p>
</div>
</body>
</html>
